content/blog/path-finding-with-RRT/path-finding-RRT.org
#+TITLE: Path Planning With RRT
#+SETUPFILE: ../../../setup/blog-post.setup
#+DATE: <2023-03-12>
#+FILETAGS: :algorithms:
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./path-finding.css"/>
#+HTML_HEAD: <script type="module" src="./path-finding.js"></script>

In my last blog post, I demonstrated the A* path planning algorithm. In this blog post, we're going to go through a sampling based approach called Rapidly Expanding Random Trees (RRT).

